import React from 'react';
import './index.css'

export default function Prehistory () {
    return (
        <div className="prehistory-container" id="prehistory">
            <h1>Як це починалось</h1>
            <p>
                <span className="title-letter">І</span>дея фонду культури зафіксована у Стратегії розвитку культури Львова 2025, що стала результатом спільної роботи представників/-ниць міського середовища культури. 
            </p>
            <p>
                Створення Фонду культури Львова є одним із завдань і напрямів статутної діяльності Інституту стратегії культури. У 2018 році ІСК розпочав роботу над створенням фонду. У партнерстві з PPV Knowledge Networks провели зустрічі з стейкхолдерами — представниками культурних середовищ Львова; <a href="/" >Звіт про зустрічі із дієвцями культури.</a> 
            </p>
            <p>
                Агенція PPV Knowledge Networks також забезпечила <a href="/">аналітику практик фінансування культури на місцевому рівні</a> за кордоном (Болгарія, Нідерланди, Велика Британія, Франція, Данія, Польща). 
            </p>
            <p>
                Запит на створення фонду культури залишається актуальним у середовищах культури Львова, що підтверджують результати дослідження Інституту стратегії культури 2019-2020 року — глибинні інтерв’ю з представниками/-цями галузі.
            </p>
        </div>
    )
}