import React, { useState } from 'react';
import './index.css';

export default function AboutProject () {
    const [toggle, setToggle] = useState(false);

    return (
        <div className="about-project-container" id="about-project">
            <div className="about-project-article" >
                <h1>Яка ідея проекту</h1>
                <p><span className="title-letter">Н</span>апрацювання моделі міського фонду культури на прикладі Фонду культури Львова — мета проєкту «Можливості та механізми створення міських фондів культури».</p>
                <h5>
                    Міський фонд культури — це можливість об’єднати, сконцентрувати ресурси, які має місто, і запропонувати вдосконалений механізм для сфери культури. Він відкриє можливості для реалізації інноваційних, найсміливіших, найнесподіваніших культурних та мистецьких проєктів. Він, очевидно, сприятиме появі та втіленню міждисциплінарних ідей, активізує взаємодію у середовищі культури, розвиток культурної екосистеми міста. Поява Фонду змінить імідж міста — як громади і як управління: це свідчення того, що культуру розуміють як простір для саморозкриття, реалізації власної суб’єктності у творенні модерної й оригінальної культури. <span className="more-block" style={{display: (!toggle ? 'block' : 'none')}} onClick={() => setToggle(true)}>Більше</span>
                </h5>
                <div style={{display: (toggle ? 'block' : 'none')}}>
                    <h5>
                        Наше майбутнє, майбутнє нашого міста — як середовища і спільноти — може бути різним. Те, яким воно стане, визначають наші сьогоднішні рішення, пріоритети, дії. Такою амбіцією — не просто дивитися у майбутнє, а моделювати, програмувати його на розвиток — є створення міського Фонду культури.
                    </h5>
                    <h5>
                        Ідея заснувати у Львові муніципальний Фонд культури — як незалежний конкурсний інструмент — має свою історію. Вона зафіксована у Стратегії розвитку культури Львова 2025, затвердженій у 2017 році. Кінець 2019-го – перша половина 2020-го, коли досвід непевності й загроженості переживався особливо гостро, лише довели: культура потребує сталих інституцій та інструментів управління, фінансування, підтримки. 
                    </h5>
                    <h5>
                        Надзвичайно цінно, що проєкт розроблення моделі міського фонду культури на прикладі Фонду культури Львова втілюється за участю представників/-ниць сфери культури, залучених експертів у галузях культури, фінансів та права. Напрацювання проєкту можуть стати основою для появи нової інституції — Фонду культури Львова, а також — прикладом для інших міст, адже в Україні немає чинних муніципальних фондів розвитку культури, створених за ініціативи та коштом органів місцевого самоврядування. 
                    </h5>
                    <h5>
                        Для започаткування нового інструменту Львів має належні передумови і актуальний контекст. Це знакові культурні події з історією, які творять обличчя міста. Добрі культурні зв’язки з іноземними партнерами, у тому числі з містами, у котрих є статус Європейської столиці культури (Вроцлав, Каунас), та задекларований намір Львова подаватися на цю конкурсну програму Європейського Союзу. Спеціалізована освітня інфраструктура, як Академія мистецтв чи Музична академія, а також підготовка культурологів в УКУ й ЛНУ ім. І.Франка. Конкурсні практики та відзнаки у сфері культури (конкурс соціокультурних проєктів, календарний план, Премія міста літератури ЮНЕСКО, програма «Львів 2020: Фокус на культуру», інші). Львів є одним із міст-лідерів на конкурсних програмах Українського культурного фонду. І чи не найголовніше: ідея створення міського Фонду культури має сталу підтримку серед дієвців культури та мистецтва Львова. 
                    </h5>
                    <h5>
                        Те, якою буде модель міського фонду культури, чи восени — із завершенням проєкту — у Львові з’явиться нова інституція Фонд культури — безпосередній результат участі та проактивності кожної і кожного з нас. <span className="more-block" style={{display: (toggle ? 'block' : 'none')}} onClick={() => setToggle(false)}>Менше</span>
                    </h5>
                </div>
            </div>
        </div>
    )
}
